using System;

class Program
{
    static void Main()
    {
        double x, y; // Абсциса і ордината графіка
        int h;       // Позиція точки на екрані

        // Виведення заголовка таблиці
        Console.WriteLine("|   x   |      y     |");
        Console.WriteLine("|-------|------------|");

        // Внутрішній цикл для одного періоду
        for (x = 0; x <= 4; x += 0.25)
        {
            // 1-й відрізок (спадна лінія)
            if (x < 1) y = 1 - x;
            // 2-й відрізок (нижня частина півкола)
            else if (x <= 3) y = -Math.Sqrt(1 - Math.Pow(x - 2, 2));
            // 3-й відрізок (зростаюча лінія)
            else y = x - 3;

            // Виведення рядка таблиці
            Console.Write("| {0,5:0.00} | {1,10:0.0000000} |", x, y);

            // Визначення позиції точки
            h = (int)((y + 2) * 10);  // Перемістили масштаб для кращого відображення

            // Виведення точки графіка
            for (int i = 0; i < h; i++) Console.Write(" ");
            Console.WriteLine("*");
        }

        // Пауза до введення команди оператора
        Console.WriteLine("Натисніть клавішу Enter...");
        Console.ReadLine();
    }
}
