/*******************************************************/
/*            Лабораторна  робота №2                   */
/*         Типи даних і введення-виведення             */
/*        Приклад виконання. Варіант № 20              */
/*******************************************************/
using System;

class Program
{
    static void Main()
    {
        // Оголошення масиву даних про рідини
        string[] names = { "Анілін", "Ртуть", "Кедрове масло" };
        char[] types = { 'Ч', 'Ч', 'М' }; // Ч - чиста речовина, М - масло
        int[] temperatures = { 20, 20, 29 };
        int[] speeds = { 1656, 1451, 1406 }; // Швидкість звуку (м/сек)

        // Виведення заголовку таблиці
        Console.WriteLine("-------------------------------------------------");
        Console.WriteLine("| Швидкість звуку в рідинах                     |");
        Console.WriteLine("|-----------------------------------------------|");
        Console.WriteLine("| Речовина       | Тип | Температура | Швидкість|");
        Console.WriteLine("|                |     | (град.С)    | (м/сек)  |");
        Console.WriteLine("|----------------|-----|-------------|----------|");

        // Виведення даних
        for (int i = 0; i < names.Length; i++)
        {
            Console.WriteLine("| {0,-14} |  {1}  |     {2,3}      |   {3,4}   |", names[i], types[i], temperatures[i], speeds[i]);
        }

        // Виведення примітки
        Console.WriteLine("-------------------------------------------------");
        Console.WriteLine("| Примітка: Ч – чиста речовина, М – масло        |");
        Console.WriteLine("-------------------------------------------------");
    }
}
