using System;

class Program
{
    static void Main()
    {
        long n = 0;               // Параметр ряду
        double sum = 0;          // Сума членів ряду
        double term;             // Значення поточного члена
        const double eps = 0.000001;  // Межа точності
        int k1 = 1;              // pow(-1, n)

        // Основний цикл
        for (; ; n++, k1 = -k1)
        {
            // Обчислення чергового члена ряду
            term = k1 * (n - 1.0) / (2 * n * n + 1.0);

            // Перевірка досягнення межі точності
            if (Math.Abs(term) >= eps)
            {
                // Якщо межа точності не досягнута - накопичення суми
                sum += term;
            }
            else
            {
                // Якщо межа точності досягнута - вихід з циклу
                break;
            }

            // Якщо враховані 10 членів - виведення суми
            if (n == 9)
            {
                Console.WriteLine($"Сума 10-ти членів ряду = {sum:F7}");
            }
        }

        // Виведення остаточного значення суми
        Console.WriteLine($"Повна сума ряду = {sum:F7}");
    }
}
